// Keyboard HID (handsfree) panel
"MSG_TYPE_PASSKEY" = "Type the following passcode then press Return on your keyboard.";

"MSG_PAIRING_TIMEOUT" = "Unable to pair with “%@.” Click Pair to try again.";
"MSG_PAIRING_TIMEOUT_AUTO" = "Unable to pair with “%@.” Trying with the next keyboard in 5 seconds.";
"MSG_PAIRING_TIMEOUT_AUTO_LAST" = "Unable to pair with “%@.” Trying again in 5 seconds.";

"MSG_PAIRING_FAILED" = "Unable to pair with your keyboard. Click Pair to try again.";
"MSG_PAIRING_FAILED_AUTO" = "Unable to pair with your keyboard. Trying again…";

// Discovery Panel (General)
"kDiscovery_Gen_ErrorOccurredSearchingKey" = "There was a problem searching for your wireless devices.";


//getPairingWithDeviceTitle;
"TITLE_PAIRING_WITH_YOUR_KEYBOARD" = "Pairing with the keyboard “%@.”";
"TITLE_PAIRING_WITH_YOUR_MOUSE" = "Pairing with the mouse “%@.”";

//getSearchingForDeviceTitle;
"TITLE_SEARCHING_FOR_YOUR_KEYBOARD" = "Searching for your keyboard…";
"TITLE_SEARCHING_FOR_YOUR_MOUSE" = "Searching for your mouse…";

//getDevicePairedTitle
"TITLE_PAIRED_KEYBOARD" = "Your computer has paired with “%@” successfully.";
"TITLE_PAIRED_MOUSE" = "Your computer has paired with “%@” successfully";

//getNFoundTitle
"TITLE_KEYBOARD_N_FOUND" = "Setup Assistant found %d wireless keyboards.";
"TITLE_MOUSE_N_FOUND" = "Setup Assistant found %d wireless mouse devices.";

//getFoundTitle
"TITLE_KEYBOARD_FOUND" = "Setup Assistant found the keyboard named “%@.”";
"TITLE_MOUSE_FOUND" = "Setup Assistant found the mouse named “%@.”";

//getMessageStartPairing
"MSG_START_PAIRING_KEYBOARD" = "Select your keyboard from the list, and then click Pair. When your keyboard is paired you will see a passcode, which you’ll type on your keyboard.";
"MSG_START_PAIRING_MOUSE" = "Setup Assistant is trying to pair with each mouse in the list. When your mouse is paired, you can move the pointer with your mouse.";

//getMessageStartPairingSingle
"MSG_START_PAIRING_KEYBOARD_SINGLE" = "Pairing with “%@” will begin automatically. When your keyboard is paired you will see a passcode, which you type on your keyboard.";
"MSG_START_PAIRING_MOUSE_SINGLE" = "Pairing with “%@” will begin automatically. When your mouse is paired, you can move the pointer using your mouse.";

//getMessageDeviceNotFound
"MSG_KEYBOARDS_NOT_FOUND_SO_FAR" = "Unable to find a keyboard. Searching…";
"MSG_MOUSE_NOT_FOUND_SO_FAR" = "Unable to find a mouse. Searching…";

//getMessageNoDevice
"MSG_NO_KEYBOARD" = "There isn’t a keyboard connected to your computer. Connect your keyboard now.";
"MSG_NO_MOUSE" = "There isn’t a mouse connected to your computer. Connect your mouse now.";

//getMessageNoDeviceBT
"MSG_NO_KEYBOARD_BLUETOOTH"	= "There isn’t a keyboard connected to your computer. Connect your keyboard now.\n\nIf you’re using an Apple Wireless Keyboard, make sure the batteries are inserted correctly and that it’s turned on.";
"MSG_NO_MOUSE_BLUETOOTH" = "There isn’t a mouse connected to your computer. Connect your mouse now.\n\nIf you’re using an Apple Wireless Mouse, find the switch on the bottom of your mouse and turn it on by sliding the cover so the LED is visible.\n\nIf you don’t use a mouse, connect your keyboard now.";

//getMessageGettingDeviceName
"MSG_GETTING_KEYBOARD_NAMES" = "Updating %d keyboard names…";
"MSG_GETTING_MOUSE_NAMES" = "Updating %d mouse names…";

//getMessageWaitingForAcknowlegement
"MSG_WAITING_FOR_KEYBOARD_ACKNOWLEGEMENT" = "To acknowledge pairing, press the Return key on your keyboard. If you don’t do this, pairing will begin again in %d seconds.";
"MSG_WAITING_FOR_MOUSE_ACKNOWLEGEMENT" = "To acknowledge pairing, use your mouse to click the OK button shown below. If you don’t do this, pairing will begin again in %d seconds.";

//getMessageAuthenticationFailure
"MSG_AUTH_FAILURE_KEYBOARD" = "You entered an incorrect passcode. Click Pair to try again.";
"MSG_AUTH_FAILURE_MOUSE" = "Pairing your mouse was not successful. Click Pair to try again.";

//getMessageAuthenticationFailureAuto
"MSG_AUTH_FAILURE_KEYBOARD_AUTO" = "You entered an incorrect passcode. Pairing with your keyboard again in 5 seconds.";
"MSG_AUTH_FAILURE_MOUSE_AUTO" = "Pairing your mouse was not successful. Pairing with your mouse again in 5 seconds.";

//getMessageAlreadyPaired
"MSG_ALREADY_PAIRED_KEYBOARD" = "Waiting for your keyboard to connect…";
"MSG_ALREADY_PAIRED_MOUSE" = "Click your mouse to begin using it.";

// ** WARNINGS **
//getWarningPairingSingle
"MSG_WARNING_PAIRING_MOUSE_SINGLE" = "If this isn’t your mouse, make sure your mouse is turned on, and then wait until searching begins again.";
"MSG_WARNING_PAIRING_KEYBOARD_SINGLE" = "If this isn’t your keyboard, make sure your keyboard is turned on, and then wait until searching begins again.";

//getWarningPairing 
"MSG_WARNING_PAIRING_MOUSE" = "If your mouse isn’t in the list, make sure it’s turned on, and then wait until searching begins again.";
"MSG_WARNING_PAIRING_KEYBOARD" = "If your keyboard isn’t in the list, make sure it’s turned on, and then click Cancel to search again.";

//getWarningAcknowlegement
"MSG_WARNING_ACK_MOUSE" = "If the pointer doesn’t move when you move your mouse,  your mouse isn’t paired with your computer. Wait until pairing begins again.";
"MSG_WARNING_ACK_KEYBOARD" = "If pressing the Return key on your keyboard doesn’t acknowledge pairing, your keyboard isn’t paired with your computer. Wait until pairing begins again.";

// ** PAIRING STATUS **
//getMessagePairingStarting
"MSG_PAIRING_STARTING" = "Pairing with your device…";

//getMessagePairingConnectingToDevice
"MSG_PAIRING_CONNECTING" = "Connecting…";

//getMessagePairingConnectionEstablished
"MSG_PAIRING_CONNECTION_ESTABLISHED" = "Connected.";

//getMessagePairingConnectionComplete
"MSG_PAIRING_COMPLETE" = "Pairing is complete.";

"CUSTOM_MOUSE_NAME"	= "%@’s Mouse";
"CUSTOM_KEYBOARD_NAME"	= "%@’s Keyboard";

